In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [5]:
import warnings
warnings.filterwarnings('ignore')

## a.타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만드시오. category1 카테고리는 다음과 같이 정의됨

1)20살이 넘으면 성별을 그대로 사용한다.

2)20살 미만이면 성별에 관계없이 “child”라고 한다.

In [2]:
# my
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
# T
titanic = sns.load_dataset('titanic')
titanic_t = titanic[['survived','sex','age','class','embark_town']]
titanic_t.tail()

     survived     sex   age   class  embark_town
886         0    male  27.0  Second  Southampton
887         1  female  19.0   First  Southampton
888         0  female   NaN   Third  Southampton
889         1    male  26.0   First    Cherbourg
890         0    male  32.0   Third   Queenstown

In [38]:
# my
def male_female_child(r):
    return r.sex if r.age >= 20 else 'child'

titanic['category1'] = titanic.apply(male_female_child, axis=1)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male

In [6]:
# T
titanic_t['category1'] = titanic_t.apply(lambda r: r.sex if r.age >= 20 else 'child', axis=1)
titanic_t.tail(2)

     survived   sex   age  class embark_town category1
889         1  male  26.0  First   Cherbourg      male
890         0  male  32.0  Third  Queenstown      male

## b.타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고치시오.

In [39]:
# titanic['age'] = titanic.age.fillna(np.round(titanic.age.mean()))
titanic.age.fillna(np.round(titanic.age.mean()), inplace=True)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,30.0,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

In [7]:
# T
titanic_t['age'] = titanic_t.age.fillna(titanic_t.age.mean()).astype(int)
#titanic_t['age'] = titanic_t.age.astype(int)
titanic_t.tail()

     survived     sex  age   class  embark_town category1
886         0    male   27  Second  Southampton      male
887         1  female   19   First  Southampton     child
888         0  female   29   Third  Southampton     child
889         1    male   26   First    Cherbourg      male
890         0    male   32   Third   Queenstown      male

## c.성별, 선실(class)별, 출발지(embark_town)별 생존율을 구하시오.

In [10]:
# T - pivot_table <성별에 따른 생존율>
titanic_t.pivot_table('survived','sex')
# groupby
titanic_t[['sex','survived']].groupby(['sex']).mean()

        survived
sex
female  0.742038
male    0.188908

In [11]:
# T - pivot_table <선실에 따른 생존율>
titanic_t.pivot_table('survived','class')

        survived
class
First   0.629630
Second  0.472826
Third   0.242363

In [12]:
# T - pivot_table <출발지별 생존율>
titanic_t.pivot_table('survived','embark_town')

             survived
embark_town
Cherbourg    0.553571
Queenstown   0.389610
Southampton  0.336957

In [13]:
# T - pivot_table <성별과 선실에 따른 생존율>
titanic_t.pivot_table('survived',['sex','class'])

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [14]:
# T 
pd.crosstab([titanic_t.sex, titanic_t.survived], titanic_t['class'],margins=True)

class            First  Second  Third  All
sex    survived
female 0             3       6     72   81
       1            91      70     72  233
male   0            77      91    300  468
       1            45      17     47  109
All                216     184    491  891

In [15]:
pd.crosstab([titanic_t.sex, titanic_t.survived], titanic_t['class'],margins=False)

class            First  Second  Third
sex    survived
female 0             3       6     72
       1            91      70     72
male   0            77      91    300
       1            45      17     47

## d.타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나누고,

각 그룹별 생존율을 구하시오.

In [17]:
# cut 명령을 사용하면 실수값을 다음처럼 카테고리 값으로 바꿈->categorical 클래스 객체
# bins 인수는 카테고리를 나누는 기준값이 된다. 영역을 넘는 값은 NaN으로 처리
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(titanic.age.values, bins, labels=labels)
cats

['청년', '중년', '청년', '중년', '중년', ..., '청년', '미성년자', NaN, '청년', '중년']
Length: 891
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [19]:
# T
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
titanic_t["age_cat"] = pd.cut(titanic.age, bins, labels=labels)
titanic_t.tail()

     survived     sex  age   class  embark_town category1 age_cat
886         0    male   27  Second  Southampton      male      청년
887         1  female   19   First  Southampton     child    미성년자
888         0  female   29   Third  Southampton     child     NaN
889         1    male   26   First    Cherbourg      male      청년
890         0    male   32   Third   Queenstown      male      중년

In [21]:
# T
titanic_t.pivot_table('survived','age_cat')

         survived
age_cat
미성년자     0.424242
청년       0.365217
중년       0.423237
장년       0.355932
노년       0.200000

In [54]:
titanic['나이별승객수'] = cats
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,나이별승객수
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male,청년
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,중년
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,청년
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,중년
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male,중년
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male,청년
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,미성년자
888,0,3,female,30.0,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,청년
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male,청년
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male,중년

In [63]:
# 그룹별 생존자수
df_s = titanic.groupby(['나이별승객수'])['survived'].count()
df_s

나이별승객수
미성년자    165
청년      407
중년      241
장년       59
노년        5
Name: survived, dtype: int64

In [67]:
# 그룹별 생존율
df_per2=np.round(df_s/df_s.sum() * 100,2)
df_per2

나이별승객수
미성년자    18.81
청년      46.41
중년      27.48
장년       6.73
노년       0.57
Name: survived, dtype: float64

## e.qcut 명령으로 세 개의 나이 그룹을 만들고, 나이 그룹별 남녀 성비와 생존율을 구하시오.
pd.qcut(): 동일 개수로 나눠서 범주 만들기

In [3]:
#  age_qcut이란 컬럼 만들고 0으로 채움
titanic['age_qcut']=0

In [ ]:
# qcut명령으로 a,b,c로 세 개의 나이 그룹 만듦
titanic['age_qcut']=pd.qcut(titanic.age, q=3, labels=['a','b','c'])
titanic.head()

In [4]:
# 나이 그룹별 남녀 성비
df_age = titanic.groupby(['age_qcut','sex'])['survived'].count()/titanic.groupby(['age_qcut'])['survived'].count()
df_age

age_qcut  sex
0         female    0.352413
          male      0.647587
Name: survived, dtype: float64

In [5]:
# 나이 그룹별 남녀 생존율
df_sur = titanic.groupby(['age_qcut','sex'])['survived'].count()
df_sur

df_sur_p = np.round(df_sur/df_sur.sum() * 100, 2)
df_sur_p

age_qcut  sex
0         female    35.24
          male      64.76
Name: survived, dtype: float64

# a.배기량(displacement) 대비 마력(horsepower) 열(hp_per_cc)을 추가하시오.

In [22]:
import seaborn as sns
mpg = sns.load_dataset('mpg')
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [26]:
mpg['hp_per_cc'] = mpg.horsepower/mpg.displacement
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,manufacturer,model,hp_per_cc
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet,chevelle malibu,0.423453
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick,skylark 320,0.471429
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth,satellite,0.471698
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc,rebel sst,0.493421
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford,torino,0.463576

# b.name으로부터 manufacturer(제조사)와 모델을 추출하여 새로운 열 manufacturer와 model을 추가하고, name 열은 삭제하시오.

In [8]:
# split method를 이용해 name으로부터 제조사와 모델 추출
sample = mpg['name'].str.split(' ')
sample.head()

0    [chevrolet, chevelle, malibu]
1            [buick, skylark, 320]
2            [plymouth, satellite]
3                [amc, rebel, sst]
4                   [ford, torino]
Name: name, dtype: object

In [23]:
# T
def get_mfcer(full_name):
    return full_name.split()[0]
def get_model(full_name):
    return ' '.join(full_name.split()[1:])

In [24]:
# T
mpg['manufacturer'] = mpg.name.apply(get_mfcer)
mpg['model'] = mpg.name.apply(get_model)
del mpg['name']
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,manufacturer,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet,chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick,skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth,satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc,rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford,torino

In [9]:
mpg['manufacturer'] = sample.str.get(0)

In [10]:
mpg['model1'] = sample.str.get(1)

In [11]:
mpg['model2'] = sample.str.get(2)
mpg.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc,manufacturer,model1,model2
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453,chevrolet,chevelle,malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429,buick,skylark,320

In [12]:
mpg['model'] = mpg.model1 + mpg.model2
mpg.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc,manufacturer,model1,model2,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453,chevrolet,chevelle,malibu,chevellemalibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429,buick,skylark,320,skylark320

In [13]:
mpg.drop(columns=["name", "model1","model2"], inplace=True)
mpg.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manufacturer,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,0.423453,chevrolet,chevellemalibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,0.471429,buick,skylark320

# c.엔진의 실린더(cylinders) 갯수별 연비(mpg)의 평균을 구하시오.

In [14]:
# mpg.pivot_table('mpg','cylinders')
mpg.groupby(['cylinders'])['mpg'].mean()

cylinders
3    20.550000
4    29.286765
5    27.366667
6    19.985714
8    14.963107
Name: mpg, dtype: float64

# d.생산지(origin)별 배기량 대비 마력(hp_per_cc)의 평균을 구하시오.

In [27]:
mpg[['origin','hp_per_cc']].groupby('origin').mean()

        hp_per_cc
origin
europe   0.740005
japan    0.789485
usa      0.512063

# e.모델이 5개 이상인 제조사에 대하여 연비(mpg)의 평균이 가장 좋은 제조사 Top 5를 구하시오.

In [28]:
mpg.manufacturer.value_counts()

ford             51
chevrolet        43
plymouth         31
dodge            28
amc              28
toyota           25
datsun           23
buick            17
pontiac          16
volkswagen       15
honda            13
mercury          11
oldsmobile       10
mazda            10
peugeot           8
fiat              8
audi              7
vw                6
volvo             6
chrysler          6
renault           5
opel              4
saab              4
subaru            4
chevy             3
maxda             2
mercedes-benz     2
cadillac          2
bmw               2
vokswagen         1
toyouta           1
capri             1
triumph           1
chevroelt         1
mercedes          1
hi                1
nissan            1
Name: manufacturer, dtype: int64

In [29]:
s = mpg.manufacturer.value_counts()
big = s[s >= 5].index.tolist()
print(big)

['ford', 'chevrolet', 'plymouth', 'dodge', 'amc', 'toyota', 'datsun', 'buick', 'pontiac', 'volkswagen', 'honda', 'mercury', 'oldsmobile', 'mazda', 'peugeot', 'fiat', 'audi', 'vw', 'volvo', 'chrysler', 'renault']

In [30]:
# in 연산자 대신에 isin() method 사용
mpg[mpg.manufacturer.isin(big)].head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,manufacturer,model,hp_per_cc
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet,chevelle malibu,0.423453
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick,skylark 320,0.471429
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth,satellite,0.471698
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc,rebel sst,0.493421
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford,torino,0.463576

In [31]:
big_mpg = mpg[mpg.manufacturer.isin(big)]
big_mpg[['manufacturer','mpg']].groupby('manufacturer').mean()

                    mpg
manufacturer
amc           18.246429
audi          26.714286
buick         19.182353
chevrolet     20.472093
chrysler      17.266667
datsun        31.113043
dodge         22.060714
fiat          28.912500
ford          19.694118
honda         33.761538
mazda         30.860000
mercury       19.118182
oldsmobile    21.100000
peugeot       23.687500
plymouth      21.703226
pontiac       20.012500
renault       32.880000
toyota        28.372000
volkswagen    29.106667
volvo         21.116667
vw            39.016667

In [32]:
big_mpg.pivot_table('mpg','manufacturer')

                    mpg
manufacturer
amc           18.246429
audi          26.714286
buick         19.182353
chevrolet     20.472093
chrysler      17.266667
datsun        31.113043
dodge         22.060714
fiat          28.912500
ford          19.694118
honda         33.761538
mazda         30.860000
mercury       19.118182
oldsmobile    21.100000
peugeot       23.687500
plymouth      21.703226
pontiac       20.012500
renault       32.880000
toyota        28.372000
volkswagen    29.106667
volvo         21.116667
vw            39.016667

In [33]:
big_mpg.pivot_table('mpg','manufacturer').sort_values(by='mpg', ascending=False)[:5]

                    mpg
manufacturer
vw            39.016667
honda         33.761538
renault       32.880000
datsun        31.113043
mazda         30.860000

## ▶ filter 사용

In [34]:
new_mpg = mpg.groupby('manufacturer').filter(lambda x: x.manufacturer.count() >= 5)
new_mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,manufacturer,model,hp_per_cc
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet,chevelle malibu,0.423453
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick,skylark 320,0.471429
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth,satellite,0.471698
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc,rebel sst,0.493421
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford,torino,0.463576

In [35]:
new_mpg.pivot_table('mpg','manufacturer').sort_values(by='mpg', ascending=False)[:5]

                    mpg
manufacturer
vw            39.016667
honda         33.761538
renault       32.880000
datsun        31.113043
mazda         30.860000